GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
enum _stop_run
{
	STOP=0,
	RUN =1,
};

static enum _stop_run	car_stop_run	= STOP;
static uint32_t			utc_car_stop	= 0;    /*车辆开始停驶时刻*/
static uint32_t			utc_car_run		= 0;    /*车辆开始行驶时刻*/

/*
   获取id下一个可用的地址
   并没有做搽除操作，交由写之前处理
   20130801:数据要位于4k边界处，不能跨扇区，否则环回写入时会出现问题

 */
static uint32_t vdr_08_12_get_nextaddr( uint8_t vdr_id )
{
	uint8_t id = vdr_id - 8;
	sect_info[id].index++;
	if( sect_info[id].index >= sect_info[id].record_per_sector )
	{
		sect_info[id].index = 0;
		sect_info[id].sector++;
		if( sect_info[id].sector >= sect_info[id].sector_count )
		{
			sect_info[id].sector = 0;
		}
	}
	return sect_info[id].addr_start + sect_info[id].sector * 4096 + sect_info[id].index * sect_info[id].record_size;
}

/*保存数据 以1秒的间隔保存数据能否处理的过来**/
void vdr_08_put( MYTIME datetime, uint8_t speed, uint8_t status )
{
	uint32_t	sec;
	uint32_t	addr;

	if( ( vdr_08_time & 0xFFFFFFC0 ) != ( datetime & 0xFFFFFFC0 ) ) /*不是在当前的一分钟内*/
	{
		if( vdr_08_time != 0 )                                      /*是有效的数据,要保存，注意第一个数据的处理*/
		{
			vdr_08_info[0]	= vdr_08_time >> 24;
			vdr_08_info[1]	= vdr_08_time >> 16;
			vdr_08_info[2]	= vdr_08_time >> 8;
			vdr_08_info[3]	= vdr_08_time & 0xFF;
			vdr_08_info[4]	= HEX2BCD( YEAR( vdr_08_time ) );
			vdr_08_info[5]	= HEX2BCD( MONTH( vdr_08_time ) );
			vdr_08_info[6]	= HEX2BCD( DAY( vdr_08_time ) );
			vdr_08_info[7]	= HEX2BCD( HOUR( vdr_08_time ) );
			vdr_08_info[8]	= HEX2BCD( MINUTE( vdr_08_time ) );
			vdr_08_info[9]	= 0;

//#ifdef TEST_BKPSRAM
#if 0
			for( i = 0; i < sizeof( vdr_08_info ); i++ )
			{
				*(__IO uint8_t*)( BKPSRAM_BASE + i + 1 ) = vdr_08_info[i];
			}
			*(__IO uint8_t*)( BKPSRAM_BASE ) = 1;
#else

			addr = vdr_08_12_get_nextaddr( 8 );
			rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
			if( ( addr & 0xFFF ) == 0 ) /*在4k边界处*/
			{
				sst25_erase_4k( addr );
			}
			sst25_write_through( addr, vdr_08_info, sizeof( vdr_08_info ) );
			rt_sem_release( &sem_dataflash );
			rt_kprintf( "\n%d>写入08 地址:%08x(sect:count=%d:%d) 值:%08x", rt_tick_get( ), addr, sect_info[0].sector, sect_info[0].index,vdr_08_time );

#endif
			memset( vdr_08_info, 0xFF, sizeof( vdr_08_info ) ); /*新的记录，初始化为0xFF*/
		}
	}
	sec							= SEC( datetime );
	vdr_08_time					= datetime;
	vdr_08_info[sec * 2 + 10]	= gps_speed;
	vdr_08_info[sec * 2 + 11]	= vdr_signal_status;
}

/*
   每扇区存6个小时的数据
   一个小时666byte 占用680byte
 */
void vdr_09_put( MYTIME datetime )
{
	uint8_t		buf[16];
	uint32_t	addr;
	uint8_t		minute;

	if( ( vdr_09_time & 0xFFFFFFC0 ) == ( datetime & 0xFFFFFFC0 ) ) /*在同一分钟内*/
	{
		return;
	}

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	if( ( vdr_09_time & 0xFFFFF000 ) != ( datetime & 0xFFFFF000 ) ) /*不是是在当前的小时内,新纪录*/
	{
		addr = vdr_08_12_get_nextaddr( 9 );
		if( ( addr & 0xFFF ) == 0 )                                 /*在4k边界处*/
		{
			sst25_erase_4k( addr );
		}

		PACK_INT( buf, ( datetime & 0xFFFFF000 ) );                 /*写入新的记录头*/
		buf[4]	= HEX2BCD( YEAR( datetime ) );
		buf[5]	= HEX2BCD( MONTH( datetime ) );
		buf[6]	= HEX2BCD( DAY( datetime ) );
		buf[7]	= HEX2BCD( HOUR( datetime ) );
		buf[8]	= 0;
		buf[9]	= 0;
		sst25_write_through( addr, buf, 10 );
	}
	vdr_09_time = datetime;
	PACK_INT( buf, ( gps_longi * 6 ) );
	PACK_INT( buf + 4, ( gps_lati * 6 ) );
	PACK_WORD( buf + 8, ( gps_alti ) );
	buf[10] = gps_speed;

	minute	= MINUTE( datetime );
	addr	= VDR_09_START + sect_info[1].sector * 4096 + sect_info[1].index * 680 + minute * 11 + 10; /*跳到指定的位置,开始有10字节头*/
	sst25_write_through( addr, buf, 11 );
	rt_sem_release( &sem_dataflash );

	rt_kprintf( "\n%d>save 09 data addr=%08x", rt_tick_get( ), addr );
}

/*
   234 byte
   这个不是秒单次触发的，而是车辆停驶产生的
 */
void vdr_10_put( MYTIME datetime )
{
	uint32_t	i, j;
	uint32_t	addr;
	uint8_t		buf[234 + 4]; /*保存要写入的信息*/
	uint8_t		* pdata;

	j		= speed_status_index;
	pdata	= buf + 28;
	for( i = 0; i < 100; i++ )
	{
		*pdata++	= speed_status[j][0];
		*pdata++	= speed_status[j][1];
		if( j == 0 )
		{
			j = 100;
		}
		j--;
	}
	buf[0]	= datetime >> 24;
	buf[1]	= datetime >> 16;
	buf[2]	= datetime >> 8;
	buf[3]	= datetime & 0xFF;
	buf[4]	= HEX2BCD( YEAR( datetime ) );
	buf[5]	= HEX2BCD( MONTH( datetime ) );
	buf[6]	= HEX2BCD( DAY( datetime ) );
	buf[7]	= HEX2BCD( HOUR( datetime ) );
	buf[8]	= HEX2BCD( MINUTE( datetime ) );
	buf[9]	= HEX2BCD( SEC( datetime ) );
	memcpy( buf + 10, jt808_param.id_0xF009, 18 );  /*驾驶证号码*/
	PACK_INT( buf + 228, ( gps_longi * 6 ) );
	PACK_INT( buf + 232, ( gps_lati * 6 ) );
	PACK_WORD( buf + 236, ( gps_alti ) );

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	addr = vdr_08_12_get_nextaddr( 10 );
	if( ( addr & 0xFFF ) == 0 )                     /*在4k边界处*/
	{
		sst25_erase_4k( addr );
	}
	sst25_write_through( addr, buf, 238 );

	rt_sem_release( &sem_dataflash );
	rt_kprintf( "\n%d>save 10 data addr=%08x", rt_tick_get( ), addr );
}

/*
   超时,疲劳驾驶记录
   有可能超时了，还在驾驶，这时要动态生成
   等到车停以后，休息了足够的时间，才是一次完整的超时驾驶记录
   如何保存?
 */
void vdr_11_put( MYTIME datetime )
{
	uint32_t	addr;
	uint8_t		buf[64];                            /*保存要写入的信息*/

	buf[0]	= datetime >> 24;
	buf[1]	= datetime >> 16;
	buf[2]	= datetime >> 8;
	buf[3]	= datetime & 0xFF;
	memcpy( buf + 4, jt808_param.id_0xF009, 18 );   /*驾驶证号码*/

	mytime_to_hex( buf + 22, vdr11_mytime_start );
	mytime_to_hex( buf + 28, datetime );

	PACK_INT( buf + 34, ( vdr11_longi_start * 6 ) );
	PACK_INT( buf + 38, ( vdr11_lati_start * 6 ) );
	PACK_WORD( buf + 42, vdr11_alti_start );

	PACK_INT( buf + 44, ( gps_longi * 6 ) );
	PACK_INT( buf + 48, ( gps_lati * 6 ) );
	PACK_WORD( buf + 52, gps_alti );

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );
	addr = vdr_08_12_get_nextaddr( 11 );
	if( ( addr & 0xFFF ) == 0 )         /*在4k边界处*/
	{
		sst25_erase_4k( addr );
	}
	sst25_write_through( addr, buf, 54 );

	rt_sem_release( &sem_dataflash );
	rt_kprintf( "\n%d>save 11 data addr=%08x", rt_tick_get( ), addr );
}

/*超速驾驶记录*/
void vdr_16_put( MYTIME datetime )
{
	uint32_t	addr;
	uint8_t		buf[64]; /*保存要写入的信息*/

	buf[0]	= datetime >> 24;
	buf[1]	= datetime >> 16;
	buf[2]	= datetime >> 8;
	buf[3]	= datetime & 0xFF;
	mytime_to_hex( buf + 4, vdr16_mytime_start );
	mytime_to_hex( buf + 10, datetime );
	PACK_WORD( buf + 16, vdr16_speed_min );
	PACK_WORD( buf + 18, vdr16_speed_max );
	PACK_WORD( buf + 20, vdr16_speed_avg );

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );
	//addr = vdr_08_12_get_nextaddr( 11 );
	if( ( addr & 0xFFF ) == 0 )  /*在4k边界处*/
	{
		sst25_erase_4k( addr );
	}
	sst25_write_through( addr, buf, 22 );

	rt_sem_release( &sem_dataflash );
	rt_kprintf( "\n%d>save 16 data addr=%08x", rt_tick_get( ), addr );
}




