GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
/*
   每秒判断车辆状态,gps中的RMC语句触发
   行驶里程
   默认都是使用GPS速度，如果gps未定位，也有秒语句输出
 */

/*gps有效情况下检查车辆行驶状态*/
void process_overtime( MYTIME datetime )
{
/*判断车辆行驶状态*/
	if( car_stop_run == STOP )                                          /*认为车辆停止,判断启动*/
	{
		if( utc_car_stop == 0 )                                         /*停车时刻尚未初始化，默认停驶*/
		{
			utc_car_stop = utc_now;
		}
		if( gps_speed >= SPEED_LIMIT )                                  /*速度大于门限值*/
		{
			if( utc_car_run == 0 )
			{
				utc_car_run = utc_now;                                  /*记录开始时刻*/
			}

			if( ( utc_now - utc_car_run ) >= SPEED_LIMIT_DURATION )     /*超过了持续时间*/
			{
				car_stop_run = RUN;                                     /*认为车辆行驶*/
				rt_kprintf( "\n%d>车辆行驶", rt_tick_get( ) );
				utc_car_stop = 0;                                       /*等待判断停驶*/
			}
		}else
		{
			if( utc_now - utc_car_stop > jt808_param.id_0x005A )        /*判断停车最长时间*/
			{
				//rt_kprintf( "达到停车最长时间\r\n" );
			}
			utc_car_run = 0;
		}
	}else                                                               /*车辆已启动*/
	{
		if( gps_speed <= SPEED_LIMIT )                                  /*速度小于门限值*/
		{
			if( utc_car_stop == 0 )
			{
				utc_car_stop = utc_now;
			}
			if( ( utc_now - utc_car_stop ) >= SPEED_LIMIT_DURATION )    /*超过了持续时间*/
			{
				car_stop_run = STOP;                                    /*认为车辆停驶*/
				rt_kprintf( "\n%d>车辆停驶", rt_tick_get( ) );
				utc_car_run = 0;
				vdr_10_put( datetime );                                 /*生成VDR_10数据,事故疑点*/
			}
		}else
		{
			if( utc_now - utc_car_run > jt808_param.id_0x0057 )         /*判断连续驾驶最长时间*/
			{
				//rt_kprintf( "达到连续驾驶最长时间\r\n" );
			}
			utc_car_stop = 0;
		}
	}
}


/*超速、超速预警判断*/
void process_overspeed( void )
{
	static uint8_t overspeed_flag=0;
	static uint32_t utc_overspeed_start;

	if( gps_speed >= jt808_param.id_0x0055 )                                    /*超过最高速度*/
	{
		if( overspeed_flag == 2 )                                               /*已超速*/
		{
			if( utc_now - utc_overspeed_start >= jt808_param.id_0x0056 )        /*已经持续超速*/
			{
				if( ( jt808_param.id_0x0050 & 0x02 ) == 0 )                     /*报警屏蔽字*/
				{
					jt808_alarm |= 0x02;
				}
			}
		}else                                                                   /*没有超速或超速预警，记录开始超速，*/
		{
			overspeed_flag		= 2;
			utc_overspeed_start = utc_now;
		}
	}else if( gps_speed >= ( jt808_param.id_0x0055 - jt808_param.id_0x005B ) )  /*超速预警*/
	{
		if( ( jt808_param.id_0x0050 & ( 1 << 13 ) ) == 0 )                      /*报警屏蔽字*/
		{
			jt808_alarm |= ( 1 << 13 );
		}
	}else                                                                       /*没有超速，也没有预警,清除标志位*/
	{
		overspeed_flag	= 0;
		jt808_alarm		&= ~( ( 1 << 1 ) | ( 1 << 13 ) );
	}
}



/*
   收到已定位gps数据的处理，
   存储位置信息，
   速度判断，校准
 */

void vdr_rx_gps( void )
{
	uint32_t datetime;

#ifdef TEST_BKPSRAM
	uint8_t buf[128];
	uint8_t *pbkpsram;
/*上电后，有要写入的历史数据 08*/
	if( *(__IO uint8_t*)( BKPSRAM_BASE ) == 1 )
	{
		pbkpsram = (__IO uint8_t*)BKPSRAM_BASE + 1;
		for( i = 0; i < 128; i++ )
		{
			buf[i] = *pbkpsram++;
		}

		*(__IO uint8_t*)( BKPSRAM_BASE ) = 0;
	}
#endif

	datetime = mytime_from_hex( gps_datetime );

	vdr_08_put( datetime, gps_speed, vdr_signal_status );
	vdr_09_put( datetime );

	/*保存数据,停车前20ms数据*/
	if( utc_now - utc_speed_status > 20 )               /*超过20秒的没有数据的间隔*/
	{
		speed_status_index = 0;                         /*重新记录*/
	}
	speed_status[speed_status_index][0] = gps_speed;    /*当前位置写入速度,200ms任务中操作*/
	utc_speed_status					= utc_now;


	process_overspeed();
	process_overtime(datetime);


	
}

/*
   初始化08 09 10 11 12的记录
   返回 记录的时刻
     0:没有记录
 */
MYTIME vdr_08_12_init( uint8_t vdr_id, uint8_t format )
{
	uint32_t	addr;
	uint8_t		buf[32];
	MYTIME		mytime_curr = 0;
	MYTIME		mytime_ret	= 0x0;

	uint8_t		sector	= 0;
	uint8_t		count	= 0;
	uint8_t		id;

	id = vdr_id - 8;

	if( format )
	{
		for( sector = 0; sector < sect_info[id].sector_count; sector++ )
		{
			sst25_erase_4k( sect_info[id].addr_start + sector * 4096 );
		}
	}
	for( sector = 0; sector < sect_info[id].sector_count; sector++ )
	{
		addr = sect_info[id].addr_start + sector * 4096;

		for( count = 0; count < sect_info[id].record_per_sector; count++ )                  /*每扇区6条记录*/
		{
			sst25_read( addr, buf, 4 );
			mytime_curr = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];   /*前4个字节代表时间*/
			if( mytime_curr != 0xFFFFFFFF )                                                 /*是有效记录*/
			{
				if( mytime_curr >= mytime_ret )
				{
					mytime_ret				= mytime_curr;
					sect_info[id].sector	= sector;
					sect_info[id].index		= count;
				}
			}
			addr += sect_info[id].record_size;
		}
	}
	rt_kprintf( "\n%d>vdr%02d time=%08x sect=%d index=%d", rt_tick_get( ), vdr_id, mytime_ret, sect_info[id].sector, sect_info[id].index );
	return mytime_ret;
}

FINSH_FUNCTION_EXPORT_ALIAS( vdr_08_12_init, vdr_format, format vdr record );

/*获取08_12的数据*/
uint16_t vdr_08_12_getdata( VDR_USERDATA *userdata, uint8_t *pout )
{
}

/*读取数据*/
uint8_t vdr_08_12_fill_data( JT808_TX_NODEDATA *pnodedata )
{
	uint32_t		i, count = 0;
	uint8_t			*pdata_body;
	uint8_t			*pdata_head;
	uint8_t			*pdata;
	VDR_USERDATA	* puserdata;
	uint32_t		addr;
	uint8_t			fcs			= 0;
	uint16_t		rec_count	= 0;
	uint8_t			id;

	puserdata = (VDR_USERDATA* )( pnodedata->user_para );   /*指向用户数据区*/

	id = puserdata->id - 8;

	if( puserdata->record_remain == 0 )                     /*已经发送完数据*/
	{
		return 0;
	}

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );  /*准备获取数据*/

	if( pnodedata->type > SINGLE_ACK )
	{
		pdata_body = pnodedata->tag_data + 16;
	}else
	{
		pdata_body = pnodedata->tag_data + 12;
	}

	/*获取要读取的记录数,有可能是多包，或不足一包*/
	rec_count = sect_info[id].record_per_packet;
	if( puserdata->record_remain < sect_info[id].record_per_packet )    /*不足构成1个发送包*/
	{
		rec_count = puserdata->record_remain;
	}

	pdata = pdata_body + 6;                                             /*跳过开始的6个字节的vdr头 55 7A*/

	for( i = 0; i < rec_count; i++ )
	{
		addr = sect_info[id].addr_start +
		       puserdata->sector * 4096 +
		       puserdata->index * sect_info[id].record_size + 4;        /*开始4字节为自己的时间*/
		sst25_read( addr, pdata, sect_info[id].data_size );

		if( puserdata->index == 0 )                                     /*调整下一个要读的位置*/
		{
			puserdata->index = sect_info[id].record_per_sector;
			if( puserdata->sector == 0 )
			{
				puserdata->sector = sect_info[id].sector_count;
			}
			puserdata->sector--;
		}
		puserdata->index--;

